final Map<String, String> qA = {
  // _ _ __ _ __ _ __ _ _حقوق بشر
  "نخستین منشور حقوق بشر جهان که آزادی دین، لغو بردگی و احترام به فرهنگ‌های مختلف را مطرح کرد توسط _ _ _ صادر شد.":
      "کوروش",
  "حق آزادی _ _ _ در حقوق بشر به این معنی است که همه حق دارند عقاید خود را بیان کنند، اما این حق محدودیت‌هایی دارد؛ مثلاً نباید شامل نفرت‌پراکنی یا تحریک به خشونت شود.":
      "بیان",
  "(مفت)حق آموزش _ _ _ و حق دسترسی به بهداشت، جزو حقوق اساسی بشر محسوب می‌شود و کشورها موظف به فراهم کردن آن هستند.":
      "رایگان",
  "(عدد سه حرفی)طبق ماده _ _ _ اعلامیه جهانی حقوق بشر، شکنجه و رفتار غیرانسانی یا تحقیرآمیز به‌طور کامل ممنوع است.":
      "پنج",
  "(یکسان)یکی از اصول حقوق بشر این است که همه‌ی انسان‌ها بدون توجه به نژاد، جنسیت، دین، زبان یا ملیت از حقوق _ _ _ برخوردارند":
      "برابر",
  "هر انسانی حق _ _ _ دارد و کسی حق گرفتن خودسرانه‌ی جان او را ندارد": "زندگی",
  "طبق کنوانسیون رفع تبعیض علیه زنان، زنان حق دارند در ازدواج و امور خانوادگی از حقوق برابر با _ _ _ برخوردار باشند":
      "مردان",
  "طبق اعلامیه استکهلم، هر فرد حق دارد در محیط زیستی سالم و عاری از _ _ _ زندگی کند.":
      "آلودگی",
  // _ _ __ _ __ _ _-- سلامتی
  "نوشیدن _ _ _ به میزان حداقل ۶–۸ لیوان در روز می‌تواند تمرکز ذهنی، کارکرد کلیه‌ها و حتی کیفیت پوست را بهبود بدهد":
      "آب",
  "ویتامین _ _ _ نقش کلیدی در انعقاد خون دارد و کمبود آن می‌تواند باعث خونریزی‌های غیرطبیعی شود":
      "کا",
  "ویتامین کا نقش کلیدی در انعقاد _ _ _ دارد و کمبود آن می‌تواند باعث خونریزی‌های غیرطبیعی شود":
      "خون",
  "میوه _ _ _  سرشار از پتاسیم است که با تنظیم فشار خون، کاهش اثرات مضر سدیم و بهبود عملکرد عضلات و اعصاب، خطر سکته و بیماری قلبی را کم می‌کند":
      "موز",
  "میوه موز  سرشار از پتاسیم است که با تنظیم فشار خون، کاهش اثرات مضر سدیم و بهبود عملکرد عضلات و اعصاب، خطر سکته و بیماری قلبی را کم می‌کند":
      "موز",
  "میوه _ _ _ سرشار از چربی‌های سالم تک‌زنجیره‌ای است که با کاهش کلسترول بد و افزایش کلسترول خوب، سلامت قلب و عروق را تقویت می‌کند":
      "آووکادو",
  "میوه آووکادو سرشار از چربی‌های سالم تک‌زنجیره‌ای است که با کاهش کلسترول بد و افزایش کلسترول خوب، سلامت قلب و _ _ _ را تقویت می‌کند":
      "عروق",
  "میوه _ _ _ خشک یک میان‌وعده غنی از آهن است و می‌تواند به کاهش کم‌خونی کمک کند":
      "زردآلو",
  "میوه _ _ _ به‌طور طبیعی باعث بهبود حرکات روده می‌شود و پزشکان اغلب آن را برای رفع یبوست توصیه می‌کنند":
      "آلو",
  "انار به خاطر پلی‌فنول‌هایش، رنگ قرمز یاقوتی دانه‌هایش را دارد و همین مواد به محافظت از رگ‌های _ _ _ کمک می‌کنند":
      "خونی",
  "میوه _ _ _ به خاطر پلی‌فنول‌هایش، رنگ قرمز یاقوتی دانه‌هایش را دارد و همین مواد به محافظت از رگ‌های خونی کمک می‌کنند":
      "انار",
  "میوه _ _ _ وقتی با پوست خورده شود، فیبر بیشتری دارد و همین فیبر باعث می‌شود مدت بیشتری احساس سیری کنید":
      "سیب",
  // ورزش
  "اولین جام جهانی فوتبال در سال ۱۹۳۰ در _ _ _ برگزار شد و تیم میزبان، با شکست آرژانتین قهرمان شد":
      "اروگوئه",
  "قانون _ _ _ در سال ۱۸۶۳ به قوانین فوتبال اضافه شد تا از تاکتیک‌های غیرمنصفانه‌ای مانند «ایستادن نزدیک دروازه حریف» جلوگیری کند":
      "آفساید",
  "طراحی معروف توپ‌های فوتبال با الگوی پنج‌ضلعی و شش‌ضلعی (معروف به تل‌استار) در دهه ۱۹۷۰ توسط _ _ _ معرفی شد":
      "آدیداس",
  "تیم ملی فوتبال _ _ _ در سال ۱۹۶۸ برای اولین بار قهرمان جام ملت‌های آسیا شد":
      "ایران",
  "ایران برای اولین بار در سال ۱۹۷۸ در جام جهانی _ _ _ حضور یافت": "آرژانتین",
  "مهسا _ _ _ اولین داور زن ایرانی است که در سال ۲۰۲۳ به لیست داوران بین‌المللی فیفا اضافه شد":
      "قربانی",
  "_ _ _ طولانی‌ترین روند شکست‌ناپذیری در مرحله مقدماتی جام جهانی در منطقه آسیا را با ۴۳ بازی بدون شکست بین سال‌های ۱۹۷۴ تا ۲۰۰۱ ثبت کرده است":
      "ایران",
  "ورزش _ _ _ به عنوان محبوب‌ترین ورزش جهان شناخته می‌شود و بیش از ۲۵۰ میلیون بازیکن فعال در بیش از ۲۰۰ کشور دارد":
      "فوتبال",
  "اولین قوانین استاندارد فوتبال در سال ۱۸۶۳ توسط انجمن فوتبال _ _ _ تدوین شد و این قوانین، که شامل ممنوعیت استفاده از دست‌ها به جز توسط دروازه‌بان است، پایه و اساس قانون فعلی را تشکیل می‌دهد":
      "انگلستان",
  "زمین فوتبال باید _ _ _ باشد و طول آن بین ۹۰ تا ۱۲۰ متر (۱۰۰ تا ۱۳۰ یارد) و عرض آن بین ۴۵ تا ۹۰ متر (۵۰ تا ۱۰۰ یارد) باشد":
      "مستطیل",
  "توپ فوتبال باید _ _ _ باشد، با محیط ۶۸ تا ۷۰ سانتی‌متر و وزن بین ۴۱۰ تا ۴۵۰ گرم، و فشار آن باید بین ۰.۶ تا ۱.۱ اتمسفر باشد تا برای بازی رسمی مناسب باشد":
      "کروی",
  "کشور _ _ _ با ۵ قهرمانی جام جهانی (۱۹۵۸، ۱۹۶۲، ۱۹۷۰، ۱۹۹۴، ۲۰۰۲) رکورددار است":
      "برزیل",
  "در فوتبال _ _ _ مسئول اصلی اجرای قوانین است و او می‌تواند با کارت زرد (هشدار) یا قرمز (اخراج) بازیکنان را جریمه کند":
      "داور",
  "براساس رکوردهای گینس _ _ _ با ۱۲۸۱ گل در ۱۳۶۳ بازی رکورددار بیشترین گل تاریخ است":
      "پله",
  "کلارنس _ _ _ تنها بازیکنی است که لیگ قهرمانان را با سه باشگاه متفاوت (آژاکس، رئال مادرید، میلان) برده":
      "سیدورف",
  "در فوتبال _ _ _ فقط توسط دروازه‌بان دفاع می‌شود، و تیرهای دروازه باید ۷.۳۲ متر (۸ یارد) عرض و ۲.۴۴ متر (۸ فوت) ارتفاع داشته باشند":
      "پنالتی",
  //   هوش
  "در یک کشو 10 جوراب قرمز و 10 جوراب آبی وجود دارد. در تاریکی، حداقل به تعداد _ _ _ جوراب باید بردارید تا مطمئن شوید حداقل یک جفت هم‌رنگ هستند":
      "سه",
  "اگر در مسابقه از نفر دوم سبقت بگیرید شما نفر _ _ _ خواهید شد": "دوم",
  "اگر به پیتزا ۳ برش مستقیم بزنید به عدد _ _ _ اسلایس خواهید داشت": "هشت",
  "اگر به پیتزا _ _ _ برش مستقیم بزنید هشت اسلایس خواهید داشت": "سه",
  //   موارد دیگر
  "حرف آخر حروف الفبای فارسی": "ی",
  "حرف ایستاده در حروف الفبای فارسی": "ا",
  "حرف خوشمزه در حروف الفبای فارسی": "ن",
  "حرفی در حروف الفبای فارسی که کلاه دارد": "آ",
  //   شعر
  "آن سو مرو این سو بیا ای گلبن خندان من\n ای _ _ _  عقل عقل من ای جان جان جان من":
      "عقل",
  "این _ _ _ بستی دهانی باز شد\n تا خورنده لقمه‌های راز شد": "دهان",
  "_ _ _ کم جو، تشنگی آور به دست\n تا بجوشد آب از بالا و پست": "آب",
  "از کجا آمده‌ام آمدنم بهر چه بود\n به کجا می‌روم آخر ننمایی _ _ _": "وطنم",
  "پس زبان محرمی خود دیگر است\n _ _ _ از هم‌زبانی بهتر است": "همدلی",
  "ای قوم به حج رفته کجایید کجایید\n _ _ _ همین جاست بیایید بیایید": "معشوق",
  "هر جا که تویی، خانه‌ی ما آن‌جاست\nبی‌تو دل ما خانه ندارد، _ _ _ است":
      "ویران",
  "دلبر و یار من تویی رونق کار من تویی\n باغ و _ _ _ من تویی بهر تو بود بود من":
      "بهار",
  "اشتیاقی که به دیدار تو دارد _ _ _ من\n دل من داند و من دانم و دل داند و من":
      "دل",
  "دلتنگم و دیدار تو _ _ _ من است\n بی رنگ رخت زمانه زندان من است": "درمان",
  "در دیاری که در او نیست کسی _ _ _ کسی\n کاش یارب که نیفتد به کسی کار کسی":
      "یار",
  "خجل شدم ز _ _ _ که زندگانی نیست\n به زندگانی من فرصت جوانی نیست": "جوانی",
  "پدرت گوهر خود تا به زر و _ _ _ فروخت\n پدر عشق بسوزد که در آمد پدرم": "سیم",
  "عشق و آزادگی و حسن و جوانی و _ _ _\n عجبا هیچ نیرزید که بی سیم و زرم": "هنر",
  "سیزده را همه عالم به در امروز از شهر\n من خود آن _ _ _ کز همه عالم به درم":
      "سیزدهم",
  "عمر ما را مهلت امروز و فردای تو نیست\n من که یک امروز مهمان توام _ _ _ چرا":
      "فردا",
  "از تو بگذشتم و بگذاشتمت با _ _ _\n رفتم از کوی تو لیکن عقب سرنگران": "دگران",
  "جوانی شمع ره کردم که جویم زندگانی را\n نجستم زندگانی را و گم کردم _ _ _ را":
      "جوانی",
  "هر چه عاشق _ _ _ تر عشقش جوانتر ای عجب\n دل دهد تاوان اگر تن ناتوان است ای پری":
      "پیر",
};
